CSI API ETABS v1
cDatabaseTables.GetObsoleteTableKeyList Method
 Returns a list of obsolete table keys for the program.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetObsoleteTableKeyList(
	ref int NumberTableKeys,
	ref string[] TableKeyList,
	ref string[] NotesList
)
Function GetObsoleteTableKeyList (
	ByRef NumberTableKeys As Integer,
	ByRef TableKeyList As String(),
	ByRef NotesList As String()
) As Integer
Dim instance As cDatabaseTables
Dim NumberTableKeys As Integer
Dim TableKeyList As String()
Dim NotesList As String()
Dim returnValue As Integer
returnValue = instance.GetObsoleteTableKeyList(NumberTableKeys,
	TableKeyList, NotesList)
int GetObsoleteTableKeyList(
	int% NumberTableKeys,
	array<String^>^% TableKeyList,
	array<String^>^% NotesList
)
abstract GetObsoleteTableKeyList :
        NumberTableKeys : int byref *
        TableKeyList : string[] byref *
        NotesList : string[] byref -> int
Parameters
NumberTableKeys
Type: System.Int32
Returned Item: The number of obsolete table keys.
TableKeyList
Type: System.String[]
Returned Item: A zero-based list of obsolete table keys.
NotesList
Type: System.String[]
Returned Item: A zero-based list of notes, one for each table key.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace